Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/presidents_role_in_representing_the_people.html.txt.tmx
Source language: en
Languages: ga

source: President - representing the people
ga: An tUachtarán - ionadaí na ndaoine

source: The President represents all the people of Ireland
ga: Is é/í an tUachtarán ionadaí mhuintir na hÉireann

source: He or she makes State visits abroad and also receives other Heads of State on visits to Ireland at the official residence, Áras an Uachtaráin
ga: Téann sé/sí ar chuairteanna stáit chuig tíortha thar lear agus san Áras an Uachtarán fáiltíonn sé/sí roimh ceannairí stáit eile atá ar chuairt in Éirinn

source: The President plays an active role in promoting Ireland's image and role in the international arena
ga: Tá ról gníomhach ag an Uachtarán íomhá na hÉireann a chur chun cinn thar lear agus i gcúrsaí idirnáisiúnta

source: The current President of Ireland is Michael D
ga: Is é Mícheál D

source: At home, the President undertakes a wide range of public engagements, attending conferences and meetings, both formal and informal, throughout the island of Ireland
ga: In Éirinn, tá go leor imeachtaí ar bun ag an Uachtarán, ag freastal ar chomhdhálacha agus ar chruinnithe, foirmiúil agus neamhfhoirimiúil, ar fud na hÉireann

source: The President also oversees the President's Award
ga: Tá an tUachtarán i gceannas ar na Duaiseanna Gaisce
